#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-A93ct19KpHtcMCr6

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0654ebbbd69258c54]
aws_instance.composer_internal: Refreshing state... [id=i-02cfe356a7283027d]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-740566457]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-842948316]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-b8f47c83-1ccd-4704-851d-48914b392c2f]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-9bf7bea8-2d91-4bb1-b1e1-95c308a14496]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "242694101" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWLRY7nJFCwm0koiETJaeCQdLSiBSgCG1njr/fUKLT/ssNd090zflG5vMd8uHJ5/3xcMiZyRnvH0qyRO33VGWlkHFWtv0SOK/cGGxy+OgOj0/6FNdVQwERgPoPTQuTzwmVZ0W+RMnNoWfGj81eP690U+Nt9ijtC6LOmVX24CxIEq2JGd/4VYpJXmwJc8PaZ6yZrRaP/zdy66CvF6RilfzqIjTfP3E9cKUvTO4lszIkbUiWuxiPiryVbr+qaGnW/JdcT+/t2k0djWp6qcGx/HcpYInjkQSf1lscBzH1XXyEuxYUlTpmcQvGTldbS8/PPdQ1wlf1QE3GAwGigzOwVA8RZJ6eRwNzIEyGAyGA3N43Ky06ZSOV8O8n0Z0cto6lapUNpLoossya2yLpOzFw+X5IG68rpMnJl26ekmWVQqOwKXjx8gx+i2olUosnPvaAZw+Zqt10l/tTsBr96cf9aBrnGysrDsJKLTjCrrjTjphUcsyaR6qWjovraxN07Jomz5T2HY9eF1n1qA7OienddjddfR+erSnx7ajbHaWLoxd8ww2JVmdUmf3sZ7Cj4mEKjObD5TdbuqZYbWhH7UEb4PFvtqfbEPa1Qbb556yScLl4WT0JGe5Ccp53OondvC6VMWDduoiTcrdqL1cH4R1aobdOg01+9wDNjk6csfsP76WpuHo3jwq135FrWAymfuWnrCz0dNjvzIWGnILSxyQwam9TlgEKkOxadix9suefD4LrwrUpGhotA3hUHYOh9dlsj9IOQvl0l4sWUzY7CPuCOYyL3P3ZFm5X0pn7RARSQzdY7eXJ32aJ4vKX29ILyrMfDnQjq2Iyl3Vmp3W6W4ZKYePmfjo7ainu+g1UFh2mC0yuBmVG9uVSEefid1i1Ktnk6jdcjrZabXYx3qNk/hVHLqTMcZGeS7WodDvYC8VoKuVuQ9bIsHrYQt+dPCJeSvvUahW2IjiQSGN/VU+65w9iNzZrK/7WZAfj7LaQ0aaqTPQr9FGEoRzd3g6CdPV9NUOZ6LSWfVWsRxEsFq0R5GHYm3aEpUTcLqauOlFfjoYG7M5CM+uJtgyWz0eBSKaz8/cNtgU1V8rEicBa0bF9uFrvpNY6nTE/pXzwxvnqT+aisBWO5e16VIRNxptl13NVtLjxO4ejKzrPuablt8jxRKYaksXDvP2Y2fOFeEuDtKvkjUOVcrIy0UR7teyDFjyxLXYtrxd75eLRrzsg6q+VhbdVOCJ++1eqGEpaLoYvQwNXZ/az49yFKweBYF0pI7UDttie9VbdcJVJyBCLEd9UYoe+2JfunsPDX1pWCp8c++tOkTuxnG//Sh2hFUQtUNB7srdqBvL/TDsdYlEHsV49W3ywctQhfbzwhLYwhKHEMUzO1VGEM+QhfyZKWgIXvcENszEmYWgilUwMh3f9QVNttBM8QWK0QiYuuSdAVbGKOuIoeQLZKt37FEmwXGCQgkqsQChg8pFKJazYOJv7EyDEB3mJtWUWPBfIcbAzOjEtDUMkSbHwjHVhU7pa3EdieUIuP4mdIBsjZONnYmvphsvsYq7NoY+QaKKbeAGY2DYbqnEh/Ky1/5qL9NcG89gLODcQdBBWFOhqgnxVj9ZGy3BclLZY6FDcNk1BaAggcpQ03wrY3sno0W8BcbwWvNsiJCm+lKsIVVTr7ZOf3R5NjMNmLlSOVjzLAx075wsHKcECNOc5Ao0EFB0cbbQt/EUjpSj52rneLOee3i2wZkuAap3/Cw5QoSOATpiR32U9dEMkg0+B1JZ6HJ5tCd0gjaJjKi3X0hgpjvTY7RRMMGl7QnHQBcjGePyZB4KAYzg1pOLs+3SdqiBLhaxj0QlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYW5ejyjtrcx/jnb4Fta7F5ZBiwRnNJlD0R5DGwJa0vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGTtdizEB51qgWNPO945EUNXedXxYI5Uv3ZUve2PtcBWxcTRaAptBVgudHQVTK1ckaFAD15OdyGmKByyM8yxFI7gHo/FE5kUe+Im3UiFEs7EZZRps9As26FUyxHFDE9wBsdYQ+JsaEuxoiMmeki08AQnlqvA8DzLQtk/zs+DI9x6ZxO1TxgBJRawYjqagVVxDN14ijBVh9S3dLU/NCnVYFbIvu17upwd/HG/jqz+3KN+6WW0jCW4Q+KgApk4NNRY0THOLDeGDhKHHtLG1iamgK7PxFayUDrMf8dXefOFbqyZaV9GyAcmEoem47V/fK+OXzhqrksF5qUEJEotIeqEWrmIsunJdsQgULWjpVKdOMfElqkT2ZEMz3Ro4xmCOTg4ORL0yVSGIpQ9ARbxdi1CBPaWpqXD7bGKbcUDqO/5ApScCRhG4/7YmswkXWVLyznaQMRz3fUOYFzvLUpzZxJV4bhEeKLvDbc8hJvEwtsjiyZoDwVxadtojpzZBA2ZEWxwEJ3xFgq+G6ht2banInIYNkazeThJqJVpNXKTqSkdR2iM2ygDwLO1DnAHMh53cmOkLCwaCwQrpmGWApJiYOYDGWBs+c6jABBqI7U8WfngHEzoHmiztoFnEErsRBxgWW68NbNECuQEWFt/F0m67Fh9CThUhJuEEVXsDjdA8LKiMxfKDkSaaE2Ko5fFYoSAN5e1OcIQxcM+DM/eKc5i10NZB4n+wqN628OJbp5nBsi1TeDMjtEGtf0NVK3MnFs5qG3rUY4moBNttD1woeBlsx2gmWi6en+Y3jQZoo46VYGGKJzBjI5MDLWblgvzbzvFxLDs5+BQXxpYWdSkahZ1uEtp3Cyq9bfGg9EIqpb1LPakpiw2u+2mKN5tHAPOVfhiWYuXuepZLwMInoMqfwoO9VNNooqwehvkwZpUT7uaJ0HNePGpL8u9jiT2e/1+/271FFbkcJ1V+Z6GCKH3+BZSrCGcLu2pAV70ARiM721uAEb/+2T1LqyjKi0vUz1/d+GjYrsN8pjPTI8W/bf8nmWr+hUuMNDVlyVUtan7XLNgneZrnhwZqfKA8oeiyu7z9zvgRlP43CIsat3B5d/QfouuDqFqW18OpoLR0pgC+wXBxXPCWFk/tVpfn6z55WTNYBuci/z+Elvv544fpfxuocmKLf3xOPK3rNik/3V/CCgtDiR+iYttkOY198z9jXtgJNi+p8zDf3APyS5sXl7jt+s3bL7f4t4yRAH3zD38uOoo4KOKNUtymbPu1d0C/sv1/dvq+P2vxX/lu+/I1wmh9EbE3/vw+3+tMM1bYVAnjZowjie7givTkqyClDbqYldF5MdjZuNnbkwYxxLCpXnNgjwi3HTUbEyBZQ/AUH2Zjp4//CnaVZTjFzV3IdtTqyV2+02p027ef7dowEjNWlvCAj4OWNB6i8Wn8Z8vOQZ1TbYhJVxS1OzyMdpsaGix+HJhnh8+fPrxHfrMf/j0rpjPzd9To4dLnmWV5owrdrcT5eTwLiGJkoJ7sAhjab7m6lPNyPbLNscK7sOnr2r63LyGtO7wfOPQbLz9FTHK1YTxX0J9+CrMH4MGd3BughdeAPpCB1ZwcAJuYECyTmtGqq8Jc0hZcrVptHZ11aJFFNBrJcGh5r7WJW5NGH9b4vcB3RHuPy+K9LaUxtyHT/9IzD9zv3GbV46vuIemdfWzWJXm6wfu19vp3uv2yz3xy123m5u6yBtv7v+T5cM/GYz7jbsiXm05fvXPFtD4UW+5/+OI4/lgx4o/EnFGpKTFibs0Zm5VVNxNQ+sbae6bF8q8XVxuOOAiUrF0lUYBI81GGNSk2+b4mOO5X375hfvw6ZvPzc/cr9yHT+9b5ud3Yvt7aTJy4oI8/jrXv4WkP5ho/iEvb6hcx5evafj3jYcfW9449gWh76G4OfAZOV3h+CZwVLH/Y+A3nN+R/LvT/PH4eu3hF93+AWsvur8r35k0fuZsY2T8aZsEp5jkf37inEuLIfFFIaMi35Pq0inS+vI8AhZ36YoVd0hIzh0IR4NdHiXNRhSwK8Mf3iF9n5w/v0f/0j8+P3C//vq+hD8QxG+NdlfeceVqUu3TiNzxXVakDCrCfTtC/f+aq8i2YORbt+tFrosoI6xuNm7t+NJ7SR5cJguez4vDl2i3EPd5+6/fwvr02BOE78Dk+Z8a/x0AAP//1TN8dywYAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "752620bd680d32564065cbe582a08c5827a24614e3cf7039fc49e3cec47d5e29" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.pozorbot_lambda_role will be created
  + resource "aws_iam_role" "pozorbot_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "AllowEC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pozorbot_lambda_role_staging"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_lambda_function.pozorbot_lambda will be created
  + resource "aws_lambda_function" "pozorbot_lambda" {
      + arn                            = (known after apply)
      + filename                       = "pozorbot.zip"
      + function_name                  = "pozorbot_staging"
      + handler                        = "pozorbot.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I3TrB41U7YUu0yCc5uZAeYPQiWpojgRS+QxzO+Ai5DE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🚨 Pozorbot lambda (staging)"
          + "ServiceOwner" = "Image Builder"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "foo" = "bar"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWLRY7nJFCwm0koiETJaeCQdLSiBSgCG1njr/fUKLT/ssNd090zflG5vMd8uHJ5/3xcMiZyRnvH0qyRO33VGWlkHFWtv0SOK/cGGxy+OgOj0/6FNdVQwERgPoPTQuTzwmVZ0W+RMnNoWfGj81eP690U+Nt9ijtC6LOmVX24CxIEq2JGd/4VYpJXmwJc8PaZ6yZrRaP/zdy66CvF6RilfzqIjTfP3E9cKUvTO4lszIkbUiWuxiPiryVbr+qaGnW/JdcT+/t2k0djWp6qcGx/HcpYInjkQSf1lscBzH1XXyEuxYUlTpmcQvGTldbS8/PPdQ1wlf1QE3GAwGigzOwVA8RZJ6eRwNzIEyGAyGA3N43Ky06ZSOV8O8n0Z0cto6lapUNpLoossya2yLpOzFw+X5IG68rpMnJl26ekmWVQqOwKXjx8gx+i2olUosnPvaAZw+Zqt10l/tTsBr96cf9aBrnGysrDsJKLTjCrrjTjphUcsyaR6qWjovraxN07Jomz5T2HY9eF1n1qA7OienddjddfR+erSnx7ajbHaWLoxd8ww2JVmdUmf3sZ7Cj4mEKjObD5TdbuqZYbWhH7UEb4PFvtqfbEPa1Qbb556yScLl4WT0JGe5Ccp53OondvC6VMWDduoiTcrdqL1cH4R1aobdOg01+9wDNjk6csfsP76WpuHo3jwq135FrWAymfuWnrCz0dNjvzIWGnILSxyQwam9TlgEKkOxadix9suefD4LrwrUpGhotA3hUHYOh9dlsj9IOQvl0l4sWUzY7CPuCOYyL3P3ZFm5X0pn7RARSQzdY7eXJ32aJ4vKX29ILyrMfDnQjq2Iyl3Vmp3W6W4ZKYePmfjo7ainu+g1UFh2mC0yuBmVG9uVSEefid1i1Ktnk6jdcjrZabXYx3qNk/hVHLqTMcZGeS7WodDvYC8VoKuVuQ9bIsHrYQt+dPCJeSvvUahW2IjiQSGN/VU+65w9iNzZrK/7WZAfj7LaQ0aaqTPQr9FGEoRzd3g6CdPV9NUOZ6LSWfVWsRxEsFq0R5GHYm3aEpUTcLqauOlFfjoYG7M5CM+uJtgyWz0eBSKaz8/cNtgU1V8rEicBa0bF9uFrvpNY6nTE/pXzwxvnqT+aisBWO5e16VIRNxptl13NVtLjxO4ejKzrPuablt8jxRKYaksXDvP2Y2fOFeEuDtKvkjUOVcrIy0UR7teyDFjyxLXYtrxd75eLRrzsg6q+VhbdVOCJ++1eqGEpaLoYvQwNXZ/az49yFKweBYF0pI7UDttie9VbdcJVJyBCLEd9UYoe+2JfunsPDX1pWCp8c++tOkTuxnG//Sh2hFUQtUNB7srdqBvL/TDsdYlEHsV49W3ywctQhfbzwhLYwhKHEMUzO1VGEM+QhfyZKWgIXvcENszEmYWgilUwMh3f9QVNttBM8QWK0QiYuuSdAVbGKOuIoeQLZKt37FEmwXGCQgkqsQChg8pFKJazYOJv7EyDEB3mJtWUWPBfIcbAzOjEtDUMkSbHwjHVhU7pa3EdieUIuP4mdIBsjZONnYmvphsvsYq7NoY+QaKKbeAGY2DYbqnEh/Ky1/5qL9NcG89gLODcQdBBWFOhqgnxVj9ZGy3BclLZY6FDcNk1BaAggcpQ03wrY3sno0W8BcbwWvNsiJCm+lKsIVVTr7ZOf3R5NjMNmLlSOVjzLAx075wsHKcECNOc5Ao0EFB0cbbQt/EUjpSj52rneLOee3i2wZkuAap3/Cw5QoSOATpiR32U9dEMkg0+B1JZ6HJ5tCd0gjaJjKi3X0hgpjvTY7RRMMGl7QnHQBcjGePyZB4KAYzg1pOLs+3SdqiBLhaxj0QlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYW5ejyjtrcx/jnb4Fta7F5ZBiwRnNJlD0R5DGwJa0vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGTtdizEB51qgWNPO945EUNXedXxYI5Uv3ZUve2PtcBWxcTRaAptBVgudHQVTK1ckaFAD15OdyGmKByyM8yxFI7gHo/FE5kUe+Im3UiFEs7EZZRps9As26FUyxHFDE9wBsdYQ+JsaEuxoiMmeki08AQnlqvA8DzLQtk/zs+DI9x6ZxO1TxgBJRawYjqagVVxDN14ijBVh9S3dLU/NCnVYFbIvu17upwd/HG/jqz+3KN+6WW0jCW4Q+KgApk4NNRY0THOLDeGDhKHHtLG1iamgK7PxFayUDrMf8dXefOFbqyZaV9GyAcmEoem47V/fK+OXzhqrksF5qUEJEotIeqEWrmIsunJdsQgULWjpVKdOMfElqkT2ZEMz3Ro4xmCOTg4ORL0yVSGIpQ9ARbxdi1CBPaWpqXD7bGKbcUDqO/5ApScCRhG4/7YmswkXWVLyznaQMRz3fUOYFzvLUpzZxJV4bhEeKLvDbc8hJvEwtsjiyZoDwVxadtojpzZBA2ZEWxwEJ3xFgq+G6ht2banInIYNkazeThJqJVpNXKTqSkdR2iM2ygDwLO1DnAHMh53cmOkLCwaCwQrpmGWApJiYOYDGWBs+c6jABBqI7U8WfngHEzoHmiztoFnEErsRBxgWW68NbNECuQEWFt/F0m67Fh9CThUhJuEEVXsDjdA8LKiMxfKDkSaaE2Ko5fFYoSAN5e1OcIQxcM+DM/eKc5i10NZB4n+wqN628OJbp5nBsi1TeDMjtEGtf0NVK3MnFs5qG3rUY4moBNttD1woeBlsx2gmWi6en+Y3jQZoo46VYGGKJzBjI5MDLWblgvzbzvFxLDs5+BQXxpYWdSkahZ1uEtp3Cyq9bfGg9EIqpb1LPakpiw2u+2mKN5tHAPOVfhiWYuXuepZLwMInoMqfwoO9VNNooqwehvkwZpUT7uaJ0HNePGpL8u9jiT2e/1+/271FFbkcJ1V+Z6GCKH3+BZSrCGcLu2pAV70ARiM721uAEb/+2T1LqyjKi0vUz1/d+GjYrsN8pjPTI8W/bf8nmWr+hUuMNDVlyVUtan7XLNgneZrnhwZqfKA8oeiyu7z9zvgRlP43CIsat3B5d/QfouuDqFqW18OpoLR0pgC+wXBxXPCWFk/tVpfn6z55WTNYBuci/z+Elvv544fpfxuocmKLf3xOPK3rNik/3V/CCgtDiR+iYttkOY198z9jXtgJNi+p8zDf3APyS5sXl7jt+s3bL7f4t4yRAH3zD38uOoo4KOKNUtymbPu1d0C/sv1/dvq+P2vxX/lu+/I1wmh9EbE3/vw+3+tMM1bYVAnjZowjie7givTkqyClDbqYldF5MdjZuNnbkwYxxLCpXnNgjwi3HTUbEyBZQ/AUH2Zjp4//CnaVZTjFzV3IdtTqyV2+02p027ef7dowEjNWlvCAj4OWNB6i8Wn8Z8vOQZ1TbYhJVxS1OzyMdpsaGix+HJhnh8+fPrxHfrMf/j0rpjPzd9To4dLnmWV5owrdrcT5eTwLiGJkoJ7sAhjab7m6lPNyPbLNscK7sOnr2r63LyGtO7wfOPQbLz9FTHK1YTxX0J9+CrMH4MGd3BughdeAPpCB1ZwcAJuYECyTmtGqq8Jc0hZcrVptHZ11aJFFNBrJcGh5r7WJW5NGH9b4vcB3RHuPy+K9LaUxtyHT/9IzD9zv3GbV46vuIemdfWzWJXm6wfu19vp3uv2yz3xy123m5u6yBtv7v+T5cM/GYz7jbsiXm05fvXPFtD4UW+5/+OI4/lgx4o/EnFGpKTFibs0Zm5VVNxNQ+sbae6bF8q8XVxuOOAiUrF0lUYBI81GGNSk2+b4mOO5X375hfvw6ZvPzc/cr9yHT+9b5ud3Yvt7aTJy4oI8/jrXv4WkP5ho/iEvb6hcx5evafj3jYcfW9449gWh76G4OfAZOV3h+CZwVLH/Y+A3nN+R/LvT/PH4eu3hF93+AWsvur8r35k0fuZsY2T8aZsEp5jkf37inEuLIfFFIaMi35Pq0inS+vI8AhZ36YoVd0hIzh0IR4NdHiXNRhSwK8Mf3iF9n5w/v0f/0j8+P3C//vq+hD8QxG+NdlfeceVqUu3TiNzxXVakDCrCfTtC/f+aq8i2YORbt+tFrosoI6xuNm7t+NJ7SR5cJguez4vDl2i3EPd5+6/fwvr02BOE78Dk+Z8a/x0AAP//1TN8dywYAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_security_group.external_composer will be updated in-place
  ~ resource "aws_security_group" "external_composer" {
        id                     = "sg-0be4cfbfac3cc0022"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "173.174.129.23/32",
                  + "185.185.130.88/32",
                ]
              + description      = "ssh for mhayden"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "173.174.129.23/32",
                ]
              - description      = "ssh for mhayden"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "185.185.130.88/32",
                ]
              - description      = "ssh for mhayden"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
            # (3 unchanged elements hidden)
        ]
        name                   = "external_composer_staging"
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "external_composer_staging"
            "ServiceOwner" = "Image Builder"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_sns_topic.user_updates will be created
  + resource "aws_sns_topic" "user_updates" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "image-builder-pozorbot-staging"
      + policy = (known after apply)
      + tags   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "🚨 Monitoring message queue (staging)"
          + "ServiceOwner" = "Image Builder"
        }
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210125184609959700000003" -> (known after apply)
      ~ id                                  = "sfr-b8f47c83-1ccd-4704-851d-48914b392c2f" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 4 to add, 2 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*